load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    # Warm-up: 5 users/sec for 10 seconds
    - duration: 10
      arrivalRate: 5
      name: "Warm-up"
    # Sustained Load: 60 users/sec for 30 seconds
    - duration: 30
      arrivalRate: 60
      name: "Sustained Load"
    # Spike: 100 users/sec for 15 seconds
    - duration: 15
      arrivalRate: 100
      name: "Spike Test"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Browse Resources"
    flow:
      # Login first to get a session cookie
      - post:
          url: "/api/auth/login"
          json:
            email: "aryan@gurukul.edu"
            password: "password123"
          capture:
            - json: "$.id"
              as: "userId"
      # Fetch resources listing
      - get:
          url: "/api/resources"
      - think: 2
      # Fetch assignments listing
      - get:
          url: "/api/assignments"
      - think: 1
      # Fetch notes
      - get:
          url: "/api/notes"
      - think: 1
      # Check notifications
      - get:
          url: "/api/notifications"

  - name: "Admin Metrics Check"
    flow:
      # Login as admin
      - post:
          url: "/api/auth/login"
          json:
            email: "elena@gurukul.edu"
            password: "password123"
      # Fetch system metrics
      - get:
          url: "/api/metrics"
      - think: 2
      # Fetch moderation queue
      - get:
          url: "/api/moderation"
      - think: 1
      # Fetch users list
      - get:
          url: "/api/users"
      # Fetch audit logs
      - get:
          url: "/api/audit"

  - name: "Teacher Assignment Flow"
    flow:
      # Login as teacher
      - post:
          url: "/api/auth/login"
          json:
            email: "priya@gurukul.edu"
            password: "password123"
      # Fetch assignments
      - get:
          url: "/api/assignments"
      - think: 2
      # Fetch resources
      - get:
          url: "/api/resources"
      - think: 1
      # Fetch chat channels
      - get:
          url: "/api/chat/channels"